<script setup lang="ts">
import { onMounted, useTemplateRef } from 'vue'
const first = useTemplateRef<HTMLParagraphElement>('first')

onMounted(() => {
  if (first.value) {
    first.value.scrollIntoView({ behavior: 'instant' })
  }
})
</script>

<template>
  <div>
    <p ref="first">
      你穿回了万历末年，一觉醒来，竟成了南直隶松江府上海县衙的一名捕快。
      清晨的班房阴冷刺骨。你正要起身盥洗，顺便去廊下晒一晒日头，同僚却把你叫住，往你怀里塞了几份折得齐整的差票。
      「嗳哟，老万，侬又走运咧。昨个上峰就点名要侬去办这桩。路上做得紧些，勿要误了程期。转来记得捎点吃食，阿拉也沾沾光。个么常州府噢……侬自家当心点，话我就勿多讲了」
      你刚要展开票子，心里却先沉了一下：这趟差，怕又不省心。
    </p>

    <p class="indent-0 m-be-0"><b>巡按南直隶监察御史 沈</b></p>
    <p class="indent-0 m-be-0"><b>为稽查私盐影射盐引等弊事 札付松江府</b></p>
    <p>
      奉都察院勘札、准南京刑部咨。内开：江南盐课亏折，近有奸商伪造盐引，影射关防，通同关津、牙行、钱铺，以票据往来隐匿课银，流害运河津口，官帑受损。合行严饬，密加稽察。已奉钦依在案，钦遵。
    </p>

    <p>
      为此札付：仰松江府即于所属上海县快班内，拣选精干捕快一名，给与关文、不得声张，赍赴常州府无锡县一带，密行稽访。到彼务照：
    </p>
    <ol>
      <li>暗访牙行钱铺及诸兑换铺户，核对其印记字号、来往票据账簿；</li>
      <li>访察运河交割、仓单船单之出入，验其盐引、关防真伪，有无影射夹带；</li>
      <li>如获实据，即先禀明常州府、无锡县官，会同拘拿要犯，封固证物，造册收贮；</li>
      <li>毋得惊扰良民，毋得漏泄风声；凡需盘诘者，须以案由为名，慎密从事。</li>
    </ol>

    <p>该役自到彼日起，限十日内具结回报；仍听随事续报。敢有迁延怠玩，定行指参究治，决不姑容</p>
    <p>右札付</p>

    <p>万历三十九年冬月初四日巡按南直隶监察御史 沈 〔花押〕〔巡按关防〕</p>
  </div>
</template>
